
&НаСервереБезКонтекста
Процедура СписокНоменклатурыПартияПриИзмененииНаСервере(Номенклатура,Партия)

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатуры.Количество КАК Количество,
		|	ОстаткиНоменклатуры.Регистратор КАК Регистратор,
		|	ПриходнаяНакладнаяСписокНоменклатуры.Количество КАК КоличествоВПартии
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры КАК ОстаткиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.СписокНоменклатуры КАК ПриходнаяНакладнаяСписокНоменклатуры
		|		ПО ОстаткиНоменклатуры.Регистратор = ПриходнаяНакладнаяСписокНоменклатуры.Ссылка
		|ГДЕ
		|	ОстаткиНоменклатуры.Регистратор = &Регистратор
		|	И ОстаткиНоменклатуры.Номенклатура = &Номенклатура
		|	И ОстаткиНоменклатуры.Количество > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПартияПриИзменении(Элемент)
	
	СписокНоменклатурыПартияПриИзмененииНаСервере(Элементы.СписокНоменклатуры.ТекущийРодитель.Номенклатура,
	Элементы.СписокНоменклатуры.ТекущийРодитель.Партия);  
	
КонецПроцедуры
